# 1) ვქმნით სიას 5 ელემენტით
my_list = ["თევზი", "კატა", "ძაღლი", "კურდღელი", "კუ"]

# მესამე ელემენტის შეცვლა "Gurami"-თ
my_list[2] = "Gurami"

# საბოლოოდ მესამე ელემენტის დაპრინტვა
print(my_list[2])  # გამოიტანს: Gurami

# 2) სია (list) არის მონაცემთა სტრუქტურა Python-ში,
# რომელიც საშუალებას გაძლევს შეინახო ელემენტების კოლექცია ერთ ცვლადში.
# სიაში შენახვა შეგიძლია:
# - ტექსტების (სტრიქონების), მაგალითად: "მარიამი"
# - რიცხვების, მაგალითად: 5, 3.14
# - სხვა სიების, მაგალითად: [1, 2, [3, 4]]
# - ასევე შეგიძლია სხვადასხვა ტიპის მონაცემების შერევა ერთ სიაში

# 3) ინდექსირება (indexing) არის ელემენტებზე წვდომის მეთოდი სიაში მათი მდებარეობის (ნომრის) მიხედვით.
# ინდექსები იწყება 0-დან.
# მაგ. თუ გაქვს სია: ["ა", "ბ", "გ"]
# "ა" აქვს ინდექსი 0
# "ბ" აქვს ინდექსი 1
# "გ" აქვს ინდექსი 2
